#coding=utf-8

ROOT_DIR = 'E:/conf_test/creditscored/'
FE_DIR = ROOT_DIR + 'featureEngineering/'  #featureEngineering_dir


NUM_BINS = 5


numericalFeatures = ['user_age','zhima_score','auth_level','company_college_length','br_score',
                'm1_verif_count','m1_register_count','m1_apply_request_count','m1_apply_reject_count',
                'm1_loan_offer_count','m1_repay_fail_count','m1_overdue_count','m1_repay_remind_count',
                'm3_verif_count','m3_register_count','m3_apply_request_count','m3_apply_reject_count',
                'm3_loan_offer_count','m3_repay_fail_count','m3_overdue_count','m3_repay_remind_count',
                'm6_verif_count','m6_register_count','m6_apply_request_count','m6_apply_reject_count',
                'm6_loan_offer_count','m6_repay_fail_count','m6_overdue_count','m6_repay_remind_count',
                'm12_verif_count','m12_register_count','m12_apply_request_count','m12_apply_reject_count',
                'm12_loan_offer_count','m12_repay_fail_count','m12_overdue_count','m12_repay_remind_count'
                ]
#类别型变量
categoricalFeatures = ['gender','job_level','phone_province','phone_city','identity_province','identity_city',
                'is_identical_phone_identity_province',
                'occupation','registerDate_xunYue','applyDate_xunYue','registerDate_hour','applyDate_hour',
                'network_len'
                ]

LABEL = 'loan_status'


xgb_params = {
        'min_child_wight' : 100,
        'eta' : 0.02,
        'colsample_bytree' : 0.8,
        'max_depth' : 6,
        'subsample' : 0.8,
        'alpha' : 1,
        'gamma' : 1,
        'slient' : 1,
        'verbose_eval' : True,
        'seed' : 1024
    }

#全国城市等级划分，共五个等级
#一线城市
city_00 = ['北京','上海','广州','深圳']
#新一线城市
city_01 = ['成都','杭州','重庆','武汉','苏州','西安','天津','南京','郑州'
           ,'宁波','东莞','无锡','长沙','沈阳','青岛']
#二线城市
city_02 = ['江汉','济南','厦门','哈尔滨','长春','福州','石家庄','佛山','烟台','合肥','昆明','唐山','济南'
       ,'大连','厦门','哈尔滨','长春','福州','石家庄'
       ,'佛山','烟台','太原','合肥','南昌','南宁','昆明','温州','淄博','唐山']
#三线城市
city_03 = [ '省直','延吉','涪陵','珲春','舟山','淮阴', '阜新','襄樊','河源','梧州','三亚',
            '延边','衡阳','梅州','乌鲁木齐','贵阳','海口','兰州','银川','西宁','呼和浩特','泉州',
            '包头','南通','大庆','徐州','潍坊','常州','鄂尔多斯'
    ,'绍兴','济宁','盐城','邯郸','临沂','洛阳','东营','扬州','台州','嘉兴','沧州','榆林','泰州','镇江','昆山','江阴','张家港'
    ,'义乌','金华','保定','吉林','鞍山','泰安','宜昌','襄阳','中山','惠州','南阳','威海','德州','岳阳','聊城','常德','漳州'
    ,'滨州','茂名','淮安','江门','芜湖','湛江','廊坊','菏泽','柳州','宝鸡','珠海','绵阳']
#四线城市
city_04 = ['德令哈','仙桃','康定','伊犁', '中卫', '黔江','万州','思茅','迪庆', '新余','怒江','临沧','双鸭山',
           '甘孜','铜仁','商洛','景德镇','漯河','潮州','白银','湘西', '西双版纳','葫芦岛','抚州','黄山',
           '白山','淮南', '恩施','眉山','平凉','河池','钦州','巢湖', '宣城','亳州','海北','株洲','枣庄',
           '许昌','通辽','湖州','新乡','咸阳','松原','连云港','安阳','周口','焦作','赤峰','邢台','郴州','宿迁'
    ,'赣州','平顶山','桂林','肇庆','曲靖','九江','商丘','汕头','信阳','驻马店','营口','揭阳','龙岩','安庆','日照','遵义'
    ,'三明','呼伦贝尔','长治','湘潭','德阳','南充','乐山','达州','盘锦','延安','上饶','锦州','宜春','宜宾','张家口','马鞍山'
    ,'吕梁','抚顺','临汾','渭南','开封','莆田','荆州','黄冈','四平','承德','齐齐哈尔','三门峡','秦皇岛','本溪','玉林','孝感'
    ,'牡丹江','荆门','宁德','运城','绥化','永州','怀化','黄石','泸州','清远','邵阳','衡水','益阳','丹东','铁岭','晋城','朔州'
    ,'吉安','娄底','玉溪','辽阳','南平','濮阳','晋中','资阳','都江堰','攀枝花','衢州','内江','滁州','阜阳','十堰','大同'
    ,'朝阳','六安','宿州','通化','蚌埠','韶关','丽水','自贡','阳江','毕节']

#五线城市
city_05=['奎屯','海晏', '梅河', '锡', '林芝', '景洪','博尔','黄南', '格尔','济源','兴义','凯里', '贵池','都匀',
         '吉首','汉中', '来宾','甘南','德宏','大兴安岭','海南','玉树', '甘南'
    , '陇南','海西', '阳泉','铜陵', '金昌','凉山','七台河', '鄂州','莱芜','伊春', '铜川','临夏','海东'
    ,'崇左','辽源','忻州','汕尾','固原','安康','定西','庆阳','楚雄','池州','鸡西','贺州','防城港','萍乡'
    ,'红河','随州','咸宁','文山', '黔东','张家界','达川','安顺','白城','黔南','贵港', '阿坝','云浮', '鹤壁'
    ,'佳木斯','黔西','六盘水','黑河','鹤岗','淮北','鹰潭','拉萨','克拉玛依','库尔勒','昌吉','哈密','伊宁','喀什',
         '阿克苏','石河子','晋江','增城','诸暨','丹阳','玉环','常熟'
    ,'崇明','余姚','奉化','海宁','浏阳市','大理','丽江','普洱','保山','昭通','西昌','雅安','广安','广元','巴中','遂宁'
    ,'天水','酒泉','嘉峪关','武威','张掖','石嘴山','吴忠','北海','百色']

